--2017-07-27 DDL (CONSTAINT)
/*
	테이블 병세
	판매전표
	=================================================================
	컬럼명	  전표번호	 판매일자	고객명	       총액
	=================================================================
	P/U/N	    PK		    NN		  NN		
	=================================================================
       참조테이블
	=================================================================
	참조컬럼
	=================================================================
	CHECK							>0
	=================================================================
	타입	VARCHAR2	DATE		VARCHAR2	NUMBER
	=================================================================
	크기	   12				  34
	=================================================================
*/
/*
CREATE TABLE 판매전표(
	전표번호 VARCHAR2(12),
	판매일자 DATE CONSTRAINT 판매전표_판매일자_nn NOT NULL,
	고객명 VARCHAR2(34) CONSTRAINT 판매전표_고객명_nn NOT NULL,
	총액 NUMBER,
	CONSTRAINT 판매전표_전표번호_pk PRIMARY KEY(전표번호),
	CONSTRAINT 판매전표_총액_ck CHECK(총액>0)
);
*/
/*
	제품
	=================================================================
	컬럼명	  제품번호	 제품명		제품단가      
	=================================================================
	P/U/N	    PK		   UK				
	=================================================================
       참조테이블
	=================================================================
	참조컬럼
	=================================================================
	CHECK					  >0
	=================================================================
	타입	VARCHAR2	VARCHAR2	NUMBER
	=================================================================
	크기	   12		   50		  
	=================================================================
*/
--DROP TABLE 제품;
/*
CREATE TABLE 제품(
	제품번호 VARCHAR2(12),
	제품명 VARCHAR2(50),
	제품단가 NUMBER,
	CONSTRAINT 제품_제품번호_pk PRIMARY KEY(제품번호),
	CONSTRAINT 제품_제품명_uk UNIQUE(제품명),
	CONSTRAINT 제품_제품단가_ck CHECK(제품단가>0)
);
*/
/*
	전표상세
	=================================================================
	컬럼명	  전표번호	 제품번호	수량	   단가	    금액      
	=================================================================
	P/U/N	     PK		    NN		 NN	    NN				
	=================================================================
       참조테이블  판매전표	  제품
	=================================================================
	참조컬럼   전표번호	제품번호
	=================================================================
	CHECK					  		     >0
	=================================================================
	타입	VARCHAR2	VARCHAR2	NUMBER	 NUMBER	  NUMBER
	=================================================================
	크기	   12		   12		  
	=================================================================
	1 aaa
	1 abc
	1 bcc
*/
/*
CREATE TABLE 전표상세(
	전표번호 VARCHAR2(12),
	제품번호 VARCHAR2(12) CONSTRAINT 전표상세_제품번호_nn NOT NULL,
	수량 NUMBER CONSTRAINT 전표상세_수량_nn NOT NULL,
	단가 NUMBER CONSTRAINT 전표상세_단가_nn NOT NULL,
	금액 NUMBER,
	CONSTRAINT 전표상세_전표번호_pk PRIMARY KEY(전표번호),
	CONSTRAINT 전표상세_전표번호_fk FOREIGN KEY(전표번호)
	REFERENCES 판매전표(전표번호),
	CONSTRAINT 전표상세_제품번호_fk FOREIGN KEY(제품번호)
	REFERENCES 제품(제품번호),
	constraint 전표상세_금액_ck CHECK(금액>0)
);
*/
/*
DROP TABLE 전표상세;
DROP TABLE 판매전표;
DROP TABLE 제품;
*/
CREATE TABLE 판매전표(
	전표번호 VARCHAR2(12),
	판매일자 DATE,
	고객명 VARCHAR2(34),
	총액 NUMBER	
);
CREATE TABLE 제품(
	제품번호 VARCHAR2(12),
	제품명 VARCHAR2(50),
	제품단가 NUMBER	
);
CREATE TABLE 전표상세(
	전표번호 VARCHAR2(12),
	제품번호 VARCHAR2(12),
	수량 NUMBER,
	단가 NUMBER,
	금액 NUMBER
);